ZigEmbeddedGroup/microzig/port/microchip/avr/src/chips/ATmega32U4.atdf
        <register caption="Data Direction Register, Port E" name="DDRE" offset="0x2D" size="1" mask="0x44"/>
        <register caption="Input Pins, Port E" name="PINE" offset="0x2C" size="1" mask="0x44" ocd-rw="R"/>
      </register-group>
      <register-group caption="I/O Port" name="PORTF">
        <register caption="Data Register, Port F" name="PORTF" offset="0x31" size="1" mask="0xF3"/>
        <register caption="Data Direction Register, Port F" name="DDRF" offset="0x30" size="1" mask="0xF3"/>
        <register caption="Input Pins, Port F" name="PINF" offset="0x2F" size="1" mask="0xF3" ocd-rw="R"/>
      </register-group>
    </module>
    <module caption="Serial Peripheral Interface" name="SPI">
      <register-group caption="Serial Peripheral Interface" name="SPI">
        <register caption="SPI Control Register" name="SPCR" offset="0x4C" size="1">
          <bitfield caption="SPI Interrupt Enable" mask="0x80" name="SPIE"/>
          <bitfield caption="SPI Enable" mask="0x40" name="SPE"/>
          <bitfield caption="Data Order" mask="0x20" name="DORD"/>
          <bitfield caption="Master/Slave Select" mask="0x10" name="MSTR"/>
          <bitfield caption="Clock polarity" mask="0x08" name="CPOL"/>
          <bitfield caption="Clock Phase" mask="0x04" name="CPHA"/>
          <bitfield caption="SPI Clock Rate Selects" mask="0x03" name="SPR" values="COMM_SCK_RATE_3BIT"/>
        </register>
        <register caption="SPI Status Register" name="SPSR" offset="0x4D" size="1" ocd-rw="R">
          <bitfield caption="SPI Interrupt Flag" mask="0x80" name="SPIF"/>
          <bitfield caption="Write Collision Flag" mask="0x40" name="WCOL"/>
          <bitfield caption="Double SPI Speed Bit" mask="0x01" name="SPI2X"/>
        </register>
        <register caption="SPI Data Register" name="SPDR" offset="0x4E" size="1" mask="0xFF" ocd-rw=""/>
      </register-group>
      <value-group name="COMM_SCK_RATE_3BIT">
        <value caption="fosc/4" name="FOSC_4" value="0x00"/>
        <value caption="fosc/16" name="FOSC_16" value="0x01"/>
        <value caption="fosc/64" name="FOSC_64" value="0x02"/>
        <value caption="fosc/128" name="FOSC_128" value="0x03"/>
        <value caption="fosc/2" name="FOSC_2" value="0x04"/>
        <value caption="fosc/8" name="FOSC_8" value="0x05"/>
        <value caption="fosc/32" name="FOSC_32" value="0x06"/>
        <value caption="fosc/64" name="FOSC_64" value="0x07"/>
      </value-group>
    </module>
    <module caption="USART" name="USART">
      <register-group caption="USART" name="USART1">
        <register caption="USART I/O Data Register" name="UDR1" offset="0xCE" size="1" mask="0xFF" ocd-rw=""/>
        <register caption="USART Control and Status Register A" name="UCSR1A" offset="0xC8" size="1" ocd-rw="R">
          <bitfield caption="USART Receive Complete" mask="0x80" name="RXC1"/>
          <bitfield caption="USART Transmit Complete" mask="0x40" name="TXC1"/>
          <bitfield caption="USART Data Register Empty" mask="0x20" name="UDRE1"/>
          <bitfield caption="Framing Error" mask="0x10" name="FE1"/>
          <bitfield caption="Data overRun" mask="0x08" name="DOR1"/>
          <bitfield caption="Parity Error" mask="0x04" name="UPE1"/>
          <bitfield caption="Double the USART transmission speed" mask="0x02" name="U2X1"/>
          <bitfield caption="Multi-processor Communication Mode" mask="0x01" name="MPCM1"/>
        </register>
        <register caption="USART Control and Status Register B" name="UCSR1B" offset="0xC9" size="1">
          <bitfield caption="RX Complete Interrupt Enable" mask="0x80" name="RXCIE1"/>
          <bitfield caption="TX Complete Interrupt Enable" mask="0x40" name="TXCIE1"/>
          <bitfield caption="USART Data register Empty Interrupt Enable" mask="0x20" name="UDRIE1"/>
          <bitfield caption="Receiver Enable" mask="0x10" name="RXEN1"/>
          <bitfield caption="Transmitter Enable" mask="0x08" name="TXEN1"/>
          <bitfield caption="Character Size" mask="0x04" name="UCSZ12"/>
          <bitfield caption="Receive Data Bit 8" mask="0x02" name="RXB81"/>
          <bitfield caption="Transmit Data Bit 8" mask="0x01" name="TXB81"/>
        </register>
        <register caption="USART Control and Status Register C" name="UCSR1C" offset="0xCA" size="1">
          <bitfield caption="USART Mode Select" mask="0xC0" name="UMSEL1" values="COMM_USART_MODE_2BIT"/>
          <bitfield caption="Parity Mode Bits" mask="0x30" name="UPM1" values="COMM_UPM_PARITY_MODE"/>
          <bitfield caption="Stop Bit Select" mask="0x08" name="USBS1" values="COMM_STOP_BIT_SEL"/>
          <bitfield caption="Character Size" mask="0x06" name="UCSZ1"/>
          <bitfield caption="Clock Polarity" mask="0x01" name="UCPOL1"/>
        </register>
        <register caption="USART Control and Status Register D" name="UCSR1D" offset="0xCB" size="1">
          <bitfield caption="CTS Enable" mask="0x02" name="CTSEN"/>
          <bitfield caption="RTS Enable" mask="0x01" name="RTSEN"/>
        </register>
        <register caption="USART Baud Rate Register  Bytes" name="UBRR1" offset="0xCC" size="2" mask="0x0FFF"/>
      </register-group>
      <value-group name="COMM_USART_MODE_2BIT">
        <value caption="Asynchronous USART" name="ASYNCHRONOUS_USART" value="0x00"/>
        <value caption="Synchronous USART" name="SYNCHRONOUS_USART" value="0x01"/>
        <value caption="Master SPI" name="MASTER_SPI" value="0x03"/>
      </value-group>
      <value-group name="COMM_UPM_PARITY_MODE">
        <value caption="Disabled" name="DISABLED" value="0x00"/>
        <value caption="Reserved" name="RESERVED" value="0x01"/>
        <value caption="Enabled, Even Parity" name="ENABLED_EVEN_PARITY" value="0x02"/>
        <value caption="Enabled, Odd Parity" name="ENABLED_ODD_PARITY" value="0x03"/>
      </value-group>
      <value-group name="COMM_STOP_BIT_SEL">
        <value caption="1-bit" name="1_BIT" value="0x00"/>
        <value caption="2-bit" name="2_BIT" value="0x01"/>
      </value-group>
    </module>
    <module caption="Bootloader" name="BOOT_LOAD">
      <register-group caption="Bootloader" name="BOOT_LOAD">
        <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1">
          <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
          <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
          <bitfield caption="Signature Row Read" mask="0x20" name="SIGRD"/>
          <bitfield caption="Read While Write section read enable" mask="0x10" name="RWWSRE"/>
          <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
          <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
          <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
          <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
        </register>
      </register-group>
    </module>
