ZigEmbeddedGroup/microzig/port/microchip/avr/src/chips/ATmega32U4.atdf
    <module caption="EEPROM" name="EEPROM">
      <register-group caption="EEPROM" name="EEPROM">
        <register caption="EEPROM Address Register Low Bytes" name="EEAR" offset="0x41" size="2" mask="0x0FFF"/>
        <register caption="EEPROM Data Register" name="EEDR" offset="0x40" size="1" mask="0xFF"/>
        <register caption="EEPROM Control Register" name="EECR" offset="0x3F" size="1">
          <bitfield caption="EEPROM Programming Mode Bits" mask="0x30" name="EEPM" values="EEP_MODE"/>
          <bitfield caption="EEPROM Ready Interrupt Enable" mask="0x08" name="EERIE"/>
          <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMPE"/>
          <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEPE"/>
          <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
        </register>
      </register-group>
      <value-group name="EEP_MODE">
        <value caption="Erase and Write in one operation" name="ERASE_AND_WRITE_IN_ONE_OPERATION" value="0x00"/>
        <value caption="Erase Only" name="ERASE_ONLY" value="0x01"/>
        <value caption="Write Only" name="WRITE_ONLY" value="0x02"/>
      </value-group>
    </module>
    <module caption="Timer/Counter, 8-bit" name="TC8">
      <register-group caption="Timer/Counter, 8-bit" name="TC0">
        <register caption="Timer/Counter0 Output Compare Register" name="OCR0B" offset="0x48" size="1" mask="0xFF"/>
        <register caption="Timer/Counter0 Output Compare Register" name="OCR0A" offset="0x47" size="1" mask="0xFF"/>
        <register caption="Timer/Counter0" name="TCNT0" offset="0x46" size="1" mask="0xFF"/>
        <register caption="Timer/Counter Control Register B" name="TCCR0B" offset="0x45" size="1">
          <bitfield caption="Force Output Compare A" mask="0x80" name="FOC0A"/>
          <bitfield caption="Force Output Compare B" mask="0x40" name="FOC0B"/>
          <bitfield mask="0x08" name="WGM02"/>
          <bitfield caption="Clock Select" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer/Counter  Control Register A" name="TCCR0A" offset="0x44" size="1">
          <bitfield caption="Compare Output Mode, Phase Correct PWM Mode" mask="0xC0" name="COM0A"/>
          <bitfield caption="Compare Output Mode, Fast PWm" mask="0x30" name="COM0B"/>
          <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM0"/>
        </register>
        <register caption="Timer/Counter0 Interrupt Mask Register" name="TIMSK0" offset="0x6E" size="1">
          <bitfield caption="Timer/Counter0 Output Compare Match B Interrupt Enable" mask="0x04" name="OCIE0B"/>
          <bitfield caption="Timer/Counter0 Output Compare Match A Interrupt Enable" mask="0x02" name="OCIE0A"/>
          <bitfield caption="Timer/Counter0 Overflow Interrupt Enable" mask="0x01" name="TOIE0"/>
        </register>
        <register caption="Timer/Counter0 Interrupt Flag register" name="TIFR0" offset="0x35" size="1" ocd-rw="R">
          <bitfield caption="Timer/Counter0 Output Compare Flag 0B" mask="0x04" name="OCF0B"/>
          <bitfield caption="Timer/Counter0 Output Compare Flag 0A" mask="0x02" name="OCF0A"/>
          <bitfield caption="Timer/Counter0 Overflow Flag" mask="0x01" name="TOV0"/>
        </register>
        <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x43" size="1">
          <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
          <bitfield caption="Prescaler Reset for Asynchronous Timer/Counters" mask="0x02" name="PSRASY"/>
          <bitfield caption="Prescaler Reset for Synchronous Timer/Counters" mask="0x01" name="PSRSYNC"/>
        </register>
      </register-group>
      <value-group name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="NO_CLOCK_SOURCE_STOPPED" value="0x00"/>
        <value caption="Running, No Prescaling" name="RUNNING_NO_PRESCALING" value="0x01"/>
        <value caption="Running, CLK/8" name="RUNNING_CLK_8" value="0x02"/>
        <value caption="Running, CLK/64" name="RUNNING_CLK_64" value="0x03"/>
        <value caption="Running, CLK/256" name="RUNNING_CLK_256" value="0x04"/>
        <value caption="Running, CLK/1024" name="RUNNING_CLK_1024" value="0x05"/>
        <value caption="Running, ExtClk Tn Falling Edge" name="RUNNING_EXTCLK_TN_FALLING_EDGE" value="0x06"/>
        <value caption="Running, ExtClk Tn Rising Edge" name="RUNNING_EXTCLK_TN_RISING_EDGE" value="0x07"/>
      </value-group>
    </module>
    <module caption="Timer/Counter, 10-bit" name="TC10">
      <register-group caption="Timer/Counter, 10-bit" name="TC4">
        <register caption="Timer/Counter4 Control Register A" name="TCCR4A" offset="0xC0" size="1">
          <bitfield caption="Compare Output Mode 1A, bits" mask="0xC0" name="COM4A"/>
          <bitfield caption="Compare Output Mode 4B, bits" mask="0x30" name="COM4B"/>
          <bitfield caption="Force Output Compare Match 4A" mask="0x08" name="FOC4A"/>
          <bitfield caption="Force Output Compare Match 4B" mask="0x04" name="FOC4B"/>
          <bitfield mask="0x02" name="PWM4A"/>
          <bitfield mask="0x01" name="PWM4B"/>
        </register>
        <register caption="Timer/Counter4 Control Register B" name="TCCR4B" offset="0xC1" size="1">
          <bitfield caption="PWM Inversion Mode" mask="0x80" name="PWM4X"/>
          <bitfield caption="Prescaler Reset Timer/Counter 4" mask="0x40" name="PSR4"/>
          <bitfield caption="Dead Time Prescaler Bits" mask="0x30" name="DTPS4"/>
          <bitfield caption="Clock Select Bits" mask="0x0F" name="CS4"/>
        </register>
        <register caption="Timer/Counter 4 Control Register C" name="TCCR4C" offset="0xC2" size="1">
          <bitfield caption="Comparator A Output Mode" mask="0x80" name="COM4A1S"/>
          <bitfield caption="Comparator A Output Mode" mask="0x40" name="COM4A0S"/>
          <bitfield caption="Comparator B Output Mode" mask="0x20" name="COM4B1S"/>
          <bitfield caption="Comparator B Output Mode" mask="0x10" name="COM4B0S"/>
          <bitfield caption="Comparator D Output Mode" mask="0x0C" name="COM4D"/>
          <bitfield caption="Force Output Compare Match 4D" mask="0x02" name="FOC4D"/>
          <bitfield caption="Pulse Width Modulator D Enable" mask="0x01" name="PWM4D"/>
        </register>
        <register caption="Timer/Counter 4 Control Register D" name="TCCR4D" offset="0xC3" size="1">
          <bitfield caption="Fault Protection Interrupt Enable" mask="0x80" name="FPIE4"/>
          <bitfield caption="Fault Protection Mode Enable" mask="0x40" name="FPEN4"/>
          <bitfield caption="Fault Protection Noise Canceler" mask="0x20" name="FPNC4"/>
          <bitfield caption="Fault Protection Edge Select" mask="0x10" name="FPES4"/>
          <bitfield caption="Fault Protection Analog Comparator Enable" mask="0x08" name="FPAC4"/>
          <bitfield caption="Fault Protection Interrupt Flag" mask="0x04" name="FPF4"/>
          <bitfield caption="Waveform Generation Mode bits" mask="0x03" name="WGM4"/>
        </register>
        <register caption="Timer/Counter 4 Control Register E" name="TCCR4E" offset="0xC4" size="1">
          <bitfield caption="Register Update Lock" mask="0x80" name="TLOCK4"/>
          <bitfield caption="Enhanced Compare/PWM Mode" mask="0x40" name="ENHC4"/>
          <bitfield caption="Output Compare Override Enable bit" mask="0x3F" name="OC4OE"/>
        </register>
        <register caption="Timer/Counter4 Low Bytes" name="TCNT4" offset="0xBE" size="1" mask="0xFF"/>
        <register caption="Timer/Counter4" name="TC4H" offset="0xBF" size="1" mask="0x07"/>
