ZigEmbeddedGroup/microzig/port/microchip/avr/src/chips/ATmega32U4.atdf
        <register caption="Timer/Counter1  Bytes" name="TCNT1" offset="0x84" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Output Compare Register A  Bytes" name="OCR1A" offset="0x88" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Output Compare Register B  Bytes" name="OCR1B" offset="0x8A" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Output Compare Register C  Bytes" name="OCR1C" offset="0x8C" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Input Capture Register  Bytes" name="ICR1" offset="0x86" size="2" mask="0xFFFF"/>
        <register caption="Timer/Counter1 Interrupt Mask Register" name="TIMSK1" offset="0x6F" size="1">
          <bitfield caption="Timer/Counter1 Input Capture Interrupt Enable" mask="0x20" name="ICIE1"/>
          <bitfield caption="Timer/Counter1 Output Compare C Match Interrupt Enable" mask="0x08" name="OCIE1C"/>
          <bitfield caption="Timer/Counter1 Output Compare B Match Interrupt Enable" mask="0x04" name="OCIE1B"/>
          <bitfield caption="Timer/Counter1 Output Compare A Match Interrupt Enable" mask="0x02" name="OCIE1A"/>
          <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x01" name="TOIE1"/>
        </register>
        <register caption="Timer/Counter1 Interrupt Flag register" name="TIFR1" offset="0x36" size="1" ocd-rw="R">
          <bitfield caption="Input Capture Flag 1" mask="0x20" name="ICF1"/>
          <bitfield caption="Output Compare Flag 1C" mask="0x08" name="OCF1C"/>
          <bitfield caption="Output Compare Flag 1B" mask="0x04" name="OCF1B"/>
          <bitfield caption="Output Compare Flag 1A" mask="0x02" name="OCF1A"/>
          <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x01" name="TOV1"/>
        </register>
      </register-group>
      <value-group name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="NO_CLOCK_SOURCE_STOPPED" value="0x00"/>
        <value caption="Running, No Prescaling" name="RUNNING_NO_PRESCALING" value="0x01"/>
        <value caption="Running, CLK/8" name="RUNNING_CLK_8" value="0x02"/>
        <value caption="Running, CLK/64" name="RUNNING_CLK_64" value="0x03"/>
        <value caption="Running, CLK/256" name="RUNNING_CLK_256" value="0x04"/>
        <value caption="Running, CLK/1024" name="RUNNING_CLK_1024" value="0x05"/>
        <value caption="Running, ExtClk Tn Falling Edge" name="RUNNING_EXTCLK_TN_FALLING_EDGE" value="0x06"/>
        <value caption="Running, ExtClk Tn Rising Edge" name="RUNNING_EXTCLK_TN_RISING_EDGE" value="0x07"/>
      </value-group>
    </module>
    <module caption="JTAG Interface" name="JTAG">
      <register-group caption="JTAG Interface" name="JTAG">
        <register caption="On-Chip Debug Related Register in I/O Memory" name="OCDR" offset="0x51" size="1" mask="0xFF" ocd-rw=""/>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
        </register>
        <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1" ocd-rw="R">
          <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
        </register>
      </register-group>
    </module>
    <module caption="External Interrupts" name="EXINT">
      <register-group caption="External Interrupts" name="EXINT">
        <register caption="External Interrupt Control Register A" name="EICRA" offset="0x69" size="1">
          <bitfield caption="External Interrupt Sense Control Bit" mask="0xC0" name="ISC3" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt Sense Control Bit" mask="0x30" name="ISC2" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt Sense Control Bit" mask="0x0C" name="ISC1" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt Sense Control Bit" mask="0x03" name="ISC0" values="INTERRUPT_SENSE_CONTROL"/>
        </register>
        <register caption="External Interrupt Control Register B" name="EICRB" offset="0x6A" size="1">
          <bitfield caption="External Interrupt 7-4 Sense Control Bit" mask="0xC0" name="ISC7" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt 7-4 Sense Control Bit" mask="0x30" name="ISC6" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt 7-4 Sense Control Bit" mask="0x0C" name="ISC5" values="INTERRUPT_SENSE_CONTROL"/>
          <bitfield caption="External Interrupt 7-4 Sense Control Bit" mask="0x03" name="ISC4" values="INTERRUPT_SENSE_CONTROL"/>
        </register>
        <register caption="External Interrupt Mask Register" name="EIMSK" offset="0x3D" size="1">
          <bitfield caption="External Interrupt Request 7 Enable" mask="0xFF" name="INT"/>
        </register>
        <register caption="External Interrupt Flag Register" name="EIFR" offset="0x3C" size="1" ocd-rw="R">
          <bitfield caption="External Interrupt Flags" mask="0xFF" name="INTF"/>
        </register>
        <register caption="Pin Change Mask Register 0" name="PCMSK0" offset="0x6B" size="1" mask="0xFF"/>
        <register caption="Pin Change Interrupt Flag Register" name="PCIFR" offset="0x3B" size="1" ocd-rw="R">
          <bitfield caption="Pin Change Interrupt Flag 0" mask="0x01" name="PCIF0"/>
        </register>
        <register caption="Pin Change Interrupt Control Register" name="PCICR" offset="0x68" size="1">
          <bitfield caption="Pin Change Interrupt Enable 0" mask="0x01" name="PCIE0"/>
        </register>
      </register-group>
      <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
        <value caption="Low Level of INTX" name="LOW_LEVEL_OF_INTX" value="0x00"/>
        <value caption="Any Logical Change of INTX" name="ANY_LOGICAL_CHANGE_OF_INTX" value="0x01"/>
        <value caption="Falling Edge of INTX" name="FALLING_EDGE_OF_INTX" value="0x02"/>
        <value caption="Rising Edge of INTX" name="RISING_EDGE_OF_INTX" value="0x03"/>
      </value-group>
    </module>
    <module caption="Two Wire Serial Interface" name="TWI">
      <register-group caption="Two Wire Serial Interface" name="TWI">
        <register caption="TWI (Slave) Address Mask Register" name="TWAMR" offset="0xBD" size="1">
          <bitfield mask="0xFE" name="TWAM"/>
        </register>
        <register caption="TWI Bit Rate register" name="TWBR" offset="0xB8" size="1" mask="0xFF"/>
        <register caption="TWI Control Register" name="TWCR" offset="0xBC" size="1" ocd-rw="R">
          <bitfield caption="TWI Interrupt Flag" mask="0x80" name="TWINT"/>
          <bitfield caption="TWI Enable Acknowledge Bit" mask="0x40" name="TWEA"/>
          <bitfield caption="TWI Start Condition Bit" mask="0x20" name="TWSTA"/>
          <bitfield caption="TWI Stop Condition Bit" mask="0x10" name="TWSTO"/>
          <bitfield caption="TWI Write Collision Flag" mask="0x08" name="TWWC"/>
          <bitfield caption="TWI Enable Bit" mask="0x04" name="TWEN"/>
          <bitfield caption="TWI Interrupt Enable" mask="0x01" name="TWIE"/>
        </register>
        <register caption="TWI Status Register" name="TWSR" offset="0xB9" size="1">
          <bitfield caption="TWI Status" mask="0xF8" name="TWS" lsb="3"/>
          <bitfield caption="TWI Prescaler" mask="0x03" name="TWPS" values="COMM_TWI_PRESCALE"/>
        </register>
        <register caption="TWI Data register" name="TWDR" offset="0xBB" size="1" mask="0xFF"/>
        <register caption="TWI (Slave) Address register" name="TWAR" offset="0xBA" size="1">
          <bitfield caption="TWI (Slave) Address register Bits" mask="0xFE" name="TWA"/>
          <bitfield caption="TWI General Call Recognition Enable Bit" mask="0x01" name="TWGCE"/>
        </register>
      </register-group>
