ZigEmbeddedGroup/microzig/port/microchip/avr/src/chips/ATmega32U4.atdf
      <value-group name="COMM_TWI_PRESCALE">
        <value caption="1" name="1" value="0x00"/>
        <value caption="4" name="4" value="0x01"/>
        <value caption="16" name="16" value="0x02"/>
        <value caption="64" name="64" value="0x03"/>
      </value-group>
    </module>
    <module caption="Analog-to-Digital Converter" name="ADC">
      <register-group caption="Analog-to-Digital Converter" name="ADC">
        <register caption="The ADC multiplexer Selection Register" name="ADMUX" offset="0x7C" size="1">
          <bitfield caption="Reference Selection Bits" mask="0xC0" name="REFS" values="ANALOG_ADC_V_REF2"/>
          <bitfield caption="Left Adjust Result" mask="0x20" name="ADLAR"/>
          <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x1F" name="MUX"/>
        </register>
        <register caption="The ADC Control and Status register" name="ADCSRA" offset="0x7A" size="1" ocd-rw="R">
          <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
          <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
          <bitfield caption="ADC Auto Trigger Enable" mask="0x20" name="ADATE"/>
          <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
          <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
          <bitfield caption="ADC  Prescaler Select Bits" mask="0x07" name="ADPS" values="ANALOG_ADC_PRESCALER"/>
        </register>
        <register caption="ADC Data Register  Bytes" name="ADC" offset="0x78" size="2" mask="0xFFFF"/>
        <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
          <bitfield caption="ADC High Speed Mode" mask="0x80" name="ADHSM"/>
          <bitfield caption="Analog Channel and Gain Selection Bits" mask="0x20" name="MUX5"/>
          <bitfield caption="ADC Auto Trigger Sources" mask="0x0F" name="ADTS" values="ANALOG_ADC_AUTO_TRIGGER2"/>
        </register>
        <register caption="Digital Input Disable Register 0" name="DIDR0" offset="0x7E" size="1">
          <bitfield caption="ADC7 Digital input Disable" mask="0x80" name="ADC7D"/>
          <bitfield caption="ADC6 Digital input Disable" mask="0x40" name="ADC6D"/>
          <bitfield caption="ADC5 Digital input Disable" mask="0x20" name="ADC5D"/>
          <bitfield caption="ADC4 Digital input Disable" mask="0x10" name="ADC4D"/>
          <bitfield caption="ADC3 Digital input Disable" mask="0x08" name="ADC3D"/>
          <bitfield caption="ADC2 Digital input Disable" mask="0x04" name="ADC2D"/>
          <bitfield caption="ADC1 Digital input Disable" mask="0x02" name="ADC1D"/>
          <bitfield caption="ADC0 Digital input Disable" mask="0x01" name="ADC0D"/>
        </register>
        <register caption="Digital Input Disable Register 2" name="DIDR2" offset="0x7D" size="1">
          <bitfield caption="ADC13 Digital input Disable" mask="0x20" name="ADC13D"/>
          <bitfield caption="ADC12 Digital input Disable" mask="0x10" name="ADC12D"/>
          <bitfield caption="ADC11 Digital input Disable" mask="0x08" name="ADC11D"/>
          <bitfield caption="ADC10 Digital input Disable" mask="0x04" name="ADC10D"/>
          <bitfield caption="ADC9 Digital input Disable" mask="0x02" name="ADC9D"/>
          <bitfield caption="ADC8 Digital input Disable" mask="0x01" name="ADC8D"/>
        </register>
      </register-group>
      <value-group name="ANALOG_ADC_V_REF2">
        <value caption="AREF, Internal Vref turned off" name="AREF_INTERNAL_VREF_TURNED_OFF" value="0x00"/>
        <value caption="AVCC with external capacitor at AREF pin" name="AVCC_WITH_EXTERNAL_CAPACITOR_AT_AREF_PIN" value="0x01"/>
        <value caption="Reserved" name="RESERVED" value="0x02"/>
        <value caption="Internal 2.56V Voltage Reference with external capacitor at AREF pin" name="INTERNAL_2_56V_VOLTAGE_REFERENCE_WITH_EXTERNAL_CAPACITOR_AT_AREF_PIN" value="0x03"/>
      </value-group>
      <value-group name="ANALOG_ADC_PRESCALER">
        <value caption="2" name="2" value="0x00"/>
        <value caption="2" name="2" value="0x01"/>
        <value caption="4" name="4" value="0x02"/>
        <value caption="8" name="8" value="0x03"/>
        <value caption="16" name="16" value="0x04"/>
        <value caption="32" name="32" value="0x05"/>
        <value caption="64" name="64" value="0x06"/>
        <value caption="128" name="128" value="0x07"/>
      </value-group>
      <value-group name="ANALOG_ADC_AUTO_TRIGGER2">
        <value caption="Free Running mode" name="FREE_RUNNING_MODE" value="0x00"/>
        <value caption="Analog Comparator" name="ANALOG_COMPARATOR" value="0x01"/>
        <value caption="External Interrupt Request 0" name="EXTERNAL_INTERRUPT_REQUEST_0" value="0x02"/>
        <value caption="Timer/Counter0 Compare Match A" name="TIMER_COUNTER0_COMPARE_MATCH_A" value="0x03"/>
        <value caption="Timer/Counter0 Overflow" name="TIMER_COUNTER0_OVERFLOW" value="0x04"/>
        <value caption="Timer/Counter1 Compare Match B" name="TIMER_COUNTER1_COMPARE_MATCH_B" value="0x05"/>
        <value caption="Timer/Counter1 Overflow" name="TIMER_COUNTER1_OVERFLOW" value="0x06"/>
        <value caption="Timer/Counter1 Capture Event" name="TIMER_COUNTER1_CAPTURE_EVENT" value="0x07"/>
        <value caption="Timer/Counter4 Overflow" name="TIMER_COUNTER4_OVERFLOW" value="0x08"/>
        <value caption="Timer/Counter4 Compare Match A" name="TIMER_COUNTER4_COMPARE_MATCH_A" value="0x09"/>
        <value caption="Timer/Counter4 Compare Match B" name="TIMER_COUNTER4_COMPARE_MATCH_B" value="0x0A"/>
        <value caption="Timer/Counter4 Compare Match D" name="TIMER_COUNTER4_COMPARE_MATCH_D" value="0x0B"/>
      </value-group>
    </module>
    <module caption="Analog Comparator" name="AC">
      <register-group caption="Analog Comparator" name="AC">
        <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
          <bitfield caption="Analog Comparator Multiplexer Enable" mask="0x40" name="ACME"/>
        </register>
        <register caption="Analog Comparator Control And Status Register" name="ACSR" offset="0x50" size="1" ocd-rw="R">
          <bitfield caption="Analog Comparator Disable" mask="0x80" name="ACD"/>
          <bitfield caption="Analog Comparator Bandgap Select" mask="0x40" name="ACBG"/>
          <bitfield caption="Analog Compare Output" mask="0x20" name="ACO"/>
          <bitfield caption="Analog Comparator Interrupt Flag" mask="0x10" name="ACI"/>
          <bitfield caption="Analog Comparator Interrupt Enable" mask="0x08" name="ACIE"/>
          <bitfield caption="Analog Comparator Input Capture Enable" mask="0x04" name="ACIC"/>
          <bitfield caption="Analog Comparator Interrupt Mode Select bits" mask="0x03" name="ACIS" values="ANALOG_COMP_INTERRUPT"/>
        </register>
        <register name="DIDR1" offset="0x7F" size="1">
          <bitfield caption="AIN1 Digital Input Disable" mask="0x02" name="AIN1D"/>
          <bitfield caption="AIN0 Digital Input Disable" mask="0x01" name="AIN0D"/>
        </register>
      </register-group>
      <value-group name="ANALOG_COMP_INTERRUPT">
        <value caption="Interrupt on Toggle" name="INTERRUPT_ON_TOGGLE" value="0x00"/>
        <value caption="Reserved" name="RESERVED" value="0x01"/>
        <value caption="Interrupt on Falling Edge" name="INTERRUPT_ON_FALLING_EDGE" value="0x02"/>
        <value caption="Interrupt on Rising Edge" name="INTERRUPT_ON_RISING_EDGE" value="0x03"/>
      </value-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Status Register" name="SREG" offset="0x5F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
