ZigEmbeddedGroup/microzig/port/microchip/avr/src/chips/ATmega32U4.atdf
        <register caption="Stack Pointer " name="SP" offset="0x5D" size="2" mask="0xFFFF"/>
        <register caption="MCU Control Register" name="MCUCR" offset="0x55" size="1">
          <bitfield caption="JTAG Interface Disable" mask="0x80" name="JTD"/>
          <bitfield caption="Pull-up disable" mask="0x10" name="PUD"/>
          <bitfield caption="Interrupt Vector Select" mask="0x02" name="IVSEL"/>
          <bitfield caption="Interrupt Vector Change Enable" mask="0x01" name="IVCE"/>
        </register>
        <register caption="MCU Status Register" name="MCUSR" offset="0x54" size="1">
          <bitfield caption="JTAG Reset Flag" mask="0x10" name="JTRF"/>
          <bitfield caption="Watchdog Reset Flag" mask="0x08" name="WDRF"/>
          <bitfield caption="Brown-out Reset Flag" mask="0x04" name="BORF"/>
          <bitfield caption="External Reset Flag" mask="0x02" name="EXTRF"/>
          <bitfield caption="Power-on reset flag" mask="0x01" name="PORF"/>
        </register>
        <register caption="Oscillator Calibration Value" name="OSCCAL" offset="0x66" size="1" mask="0xFF">
          <bitfield caption="Oscillator Calibration " mask="0xFF" name="OSCCAL"/>
        </register>
        <register caption="Oscillator Control Register" name="RCCTRL" offset="0x67" size="1">
          <bitfield mask="0x01" name="RCFREQ"/>
        </register>
        <register name="CLKPR" offset="0x61" size="1">
          <bitfield mask="0x80" name="CLKPCE"/>
          <bitfield mask="0x0F" name="CLKPS" values="CPU_CLK_PRESCALE_4_BITS_SMALL"/>
        </register>
        <register caption="Sleep Mode Control Register" name="SMCR" offset="0x53" size="1">
          <bitfield caption="Sleep Mode Select bits" mask="0x0E" name="SM" values="CPU_SLEEP_MODE_3BITS"/>
          <bitfield caption="Sleep Enable" mask="0x01" name="SE"/>
        </register>
        <register caption="Extended Indirect Register" name="EIND" offset="0x5C" size="1" mask="0x01"/>
        <register caption="Extended Z-pointer Register for ELPM/SPM" name="RAMPZ" offset="0x5B" size="1">
          <bitfield caption="Reserved" mask="0xFC" name="Res"/>
          <bitfield caption="Extended Z-Pointer Value" mask="0x03" name="RAMPZ" values="RAMPZ_BITF"/>
        </register>
        <register caption="General Purpose IO Register 2" name="GPIOR2" offset="0x4B" size="1">
          <bitfield caption="General Purpose IO Register 2 bis" mask="0xFF" name="GPIOR" lsb="20"/>
        </register>
        <register caption="General Purpose IO Register 1" name="GPIOR1" offset="0x4A" size="1">
          <bitfield caption="General Purpose IO Register 1 bis" mask="0xFF" name="GPIOR" lsb="10"/>
        </register>
        <register caption="General Purpose IO Register 0" name="GPIOR0" offset="0x3E" size="1">
          <bitfield caption="General Purpose IO Register 0 bit 7" mask="0x80" name="GPIOR07"/>
          <bitfield caption="General Purpose IO Register 0 bit 6" mask="0x40" name="GPIOR06"/>
          <bitfield caption="General Purpose IO Register 0 bit 5" mask="0x20" name="GPIOR05"/>
          <bitfield caption="General Purpose IO Register 0 bit 4" mask="0x10" name="GPIOR04"/>
          <bitfield caption="General Purpose IO Register 0 bit 3" mask="0x08" name="GPIOR03"/>
          <bitfield caption="General Purpose IO Register 0 bit 2" mask="0x04" name="GPIOR02"/>
          <bitfield caption="General Purpose IO Register 0 bit 1" mask="0x02" name="GPIOR01"/>
          <bitfield caption="General Purpose IO Register 0 bit 0" mask="0x01" name="GPIOR00"/>
        </register>
        <register caption="Power Reduction Register1" name="PRR1" offset="0x65" size="1">
          <bitfield caption="Power Reduction USB" mask="0x80" name="PRUSB"/>
          <bitfield caption="Power Reduction Timer/Counter4" mask="0x10" name="PRTIM4"/>
          <bitfield caption="Power Reduction Timer/Counter3" mask="0x08" name="PRTIM3"/>
          <bitfield caption="Power Reduction USART1" mask="0x01" name="PRUSART1"/>
        </register>
        <register caption="Power Reduction Register0" name="PRR0" offset="0x64" size="1">
          <bitfield caption="Power Reduction TWI" mask="0x80" name="PRTWI"/>
          <bitfield caption="Power Reduction Timer/Counter2" mask="0x40" name="PRTIM2"/>
          <bitfield caption="Power Reduction Timer/Counter0" mask="0x20" name="PRTIM0"/>
          <bitfield caption="Power Reduction Timer/Counter1" mask="0x08" name="PRTIM1"/>
          <bitfield caption="Power Reduction Serial Peripheral Interface" mask="0x04" name="PRSPI"/>
          <bitfield caption="Power Reduction USART" mask="0x02" name="PRUSART0"/>
          <bitfield caption="Power Reduction ADC" mask="0x01" name="PRADC"/>
        </register>
        <register name="CLKSTA" offset="0xC7" size="1" ocd-rw="R">
          <bitfield mask="0x02" name="RCON"/>
          <bitfield mask="0x01" name="EXTON"/>
        </register>
        <register name="CLKSEL1" offset="0xC6" size="1">
          <bitfield mask="0xF0" name="RCCKSEL"/>
          <bitfield mask="0x0F" name="EXCKSEL"/>
        </register>
        <register name="CLKSEL0" offset="0xC5" size="1">
          <bitfield mask="0xC0" name="RCSUT"/>
          <bitfield mask="0x30" name="EXSUT"/>
          <bitfield mask="0x08" name="RCE"/>
          <bitfield mask="0x04" name="EXTE"/>
          <bitfield mask="0x01" name="CLKS"/>
        </register>
      </register-group>
      <value-group name="CPU_CLK_PRESCALE_4_BITS_SMALL">
        <value caption="1" name="1" value="0x00"/>
        <value caption="2" name="2" value="0x01"/>
        <value caption="4" name="4" value="0x02"/>
        <value caption="8" name="8" value="0x03"/>
        <value caption="16" name="16" value="0x04"/>
        <value caption="32" name="32" value="0x05"/>
        <value caption="64" name="64" value="0x06"/>
        <value caption="128" name="128" value="0x07"/>
        <value caption="256" name="256" value="0x08"/>
      </value-group>
      <value-group name="CPU_SLEEP_MODE_3BITS">
        <value caption="Idle" name="IDLE" value="0x00"/>
        <value caption="ADC Noise Reduction (If Available)" name="ADC" value="0x01"/>
        <value caption="Power Down" name="PDOWN" value="0x02"/>
        <value caption="Power Save" name="PSAVE" value="0x03"/>
        <value caption="Reserved" name="VAL_0x04" value="0x04"/>
        <value caption="Reserved" name="VAL_0x05" value="0x05"/>
        <value caption="Standby" name="STDBY" value="0x06"/>
        <value caption="Extended Standby" name="ESTDBY" value="0x07"/>
      </value-group>
      <value-group name="RAMPZ_BITF">
        <value caption="Default value of Z-pointer MSB's." name="DEFAULT_VALUE_OF_Z_POINTER_MSB_S" value="0"/>
      </value-group>
      <value-group caption="Oscillator Calibration Values" name="OSCCAL_VALUE_ADDRESSES">
        <value value="0x00" caption="8.0 MHz" name="8_0_MHz"/>
      </value-group>
      
    </module>
    <module caption="Phase Locked Loop" name="PLL">
      <register-group caption="Phase Locked Loop" name="PLL">
        <register caption="PLL Status and Control register" name="PLLCSR" offset="0x49" size="1">
          <bitfield caption="PLL prescaler Bit 2" mask="0x10" name="PINDIV"/>
          <bitfield caption="PLL Enable Bit" mask="0x02" name="PLLE"/>
          <bitfield caption="PLL Lock Status Bit" mask="0x01" name="PLOCK"/>
        </register>
        <register caption="PLL Frequency Control Register" name="PLLFRQ" offset="0x52" size="1">
          <bitfield mask="0x80" name="PINMUX"/>
          <bitfield mask="0x40" name="PLLUSB"/>
          <bitfield mask="0x30" name="PLLTM"/>
          <bitfield mask="0x0F" name="PDIV"/>
        </register>
      </register-group>
    </module>
